Tutorials/kOmegaStab/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2;

boundaryField
{
    inlet
    {
        type            cyclic;
        value           uniform 2;
    }
    bottom
    {
      type zeroGradient;
      /*
        type            omegaWallFunction;
        refValue        uniform 0;
        value           uniform 2;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
      */
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 2;
        value           uniform 2;
    }
    frontBack
    {
        type            empty;
    }
}


// ************************************************************************* //
